{
  "translation": {
    "language": "Español",
    "menu": {
      "aptitud": "Aptitudes",
      "experience": "Experiencia",
      "studies": "Estudios",
      "concerns": "Intereses",
      "contact": "Contacto"
    },
    "aptitudes": {
      "title": "Aptitudes",
      "im": "Soy Nestor Gutiérrez",
      "description": "Desarrollador Full Stack con pasión por crear código. Con experiencia en computación en la nube y dedicado a construir software que ofrezca una excelente experiencia de usuario. Disfruto programando mientras escucho música."
    },
    "experiences": {
      "title": "Experiencia",
      "actual": "Actual",
      "tw": "Desarrollo de aplicaciones utilizando NestJs para el backend y React para el frontend, integrando la plataforma de ecommerce VTEX en uno de los proyectos. Además, colaboré en la creación de una aplicación de Chat Web para la Fundación Todo Mejora, utilizando React JS en el frontend y Firestore para el almacenamiento de información. En este proyecto también realicé modificaciones en una cloud function encargada de la recepción y envío de mensajes. Asimismo, trabajé en la mejora del flujo de despliegues, automatizando la tarea de creación de tags de los ambientes mediante GitHub Actions. Como Senior Developer Consultant, participé en la toma de decisiones técnicas y lideré al equipo en la implementación de soluciones eficientes.",
      "option": "Trabajé como Full Stack Developer en un proyecto para una empresa minera. En este proyecto desarrollé aplicaciones web utilizando ReactJs como librería de Front-end, que mostraba información de los activos de la empresa. La aplicación contempla la generación de dashboards para mostrar la información procesada por los ETL. A nivel de Back-end, utilicé Docker container junto con el framework Python Flask para generar una API orquestada por Fargate en AWS. Además, la aplicación del Back-end también sirvió como mantenedor y visualizador del dashboard.",
      "arkho": "Durante mi experiencia laboral, he desarrollado habilidades en el desarrollo de aplicaciones web utilizando tecnologías como Angular v7/8 y bases de datos en RDS. También he participado en la creación de ETLs utilizando una variedad de servicios de AWS, incluyendo Lambda, Step Functions, Athena, Glue, SQS, Redshift y S3. Además, he implementado chatbots para páginas web, donde he trabajado en la configuración de estilos y en la creación de lambdas encargadas del mantenedor, utilizando Elastic Search para el almacenamiento de datos. Finalmente, he desarrollado una integración entre sistemas para generar reportes y notificaciones de avance de proyectos a través de una API externa. Estas habilidades me han permitido tener éxito en proyectos complejos y en un entorno de alta presión.",
      "karibu": "Como Full Stack Developer, desarrollé aplicaciones web utilizando el framework Front-end Nuxt y en el backend utilicé NodeJs con Express para crear APIs RESTful. Implementé almacenamiento seguro de credenciales e información en el Front-end mediante la librería Vuex y utilicé Firebase para la autenticación de usuarios y el deploy del Front-end de la aplicación. También desplegué el backend en Google Cloud Platform (GCP) y utilizamos la base de datos de GCP para almacenar los datos de la aplicación.",
      "ssilva": "Trabajé como Frontend Developer en un proyecto de sistema web para una inmobiliaria, donde desarrollé componentes con el Framework VueJs y utilicé la librería Vuex para implementar almacenamiento de credenciales de acceso seguras en la capa Front-end. También configuré y utilicé Axios para la comunicación entre las capas Front-end y Back-end.",
      "vendy": "Participé en el desarrollo de sistemas web mediante la implementación de tecnologías como Node.js y Express para la creación de APIs de Back-end. También, trabajé con bases de datos MySQL para el almacenamiento de datos del sistema y utilicé tecnologías de comercio electrónico como Braintree. Además, contribuí al desarrollo de aplicaciones web utilizando tecnologías como MySQL, Node.js y Express, con el fin de mejorar la experiencia de usuario y la eficiencia del sistema.",
      "develoop": "Durante esta experiencia laboral, participé en el desarrollo de sistemas web utilizando tecnologías como MySQL, PHP, Laravel Framework, Javascript y CSS. Me enfoqué en un proyecto especial para generar un plano 3D de tuberías dentro de una fábrica, donde colaboré en el diseño y desarrollo de la funcionalidad 2D en la web y su posterior transformación a 3D mediante el uso de ThreeJS. Fue una gran oportunidad para aplicar mis conocimientos en tecnologías de vanguardia y para trabajar en equipo en la resolución de un desafío técnico importante."
    },
    "studies": {
      "title": "Estudios",
      "credential": "ID Certificación"
    },
    "interests": {
      "title": "Intereses",
      "description": "Mantenerme activo es importante para mí, y disfruto de actividades como crossfit y senderismo para ayudarme a mantenerme enérgico. La fotografía es una de mis pasiones y me encanta capturar momentos especiales y paisajes hermosos. Tengo un gusto diverso en música y disfruto asistir a conciertos para experimentar con nuevos géneros. La cocina es otro de mis intereses y recientemente tomé un taller para aprender a hacer diferentes tipos de pasta."
    },
    "contact": {
      "title": "Contacto"
    }
  }
}
